In [1]:
import pymysql
from sqlalchemy import create_engine
import pandas as pd
import getpass
password = getpass.getpass ()

········

In [2]:
#get the data
connection_string = 'mysql+pymysql://root:'+password+'@localhost/sakila'
engine = create_engine(connection_string)

In [4]:
## Create a query or queries to extract the information you think may be relevant for building the prediction model. 
## It should include some film features and some rental features. Use the data from 2005.

In [5]:
#get the data
query = '''select f.film_id, f.title, f.description, f.release_year, f.rental_duration, f.length, i.inventory_id, i.store_id,
        r.rental_id, r.customer_id, r.rental_date, r.staff_id
        from film as f
        join inventory as i
        on f.film_id = i.film_id
        join rental as r
        on i.inventory_id = r.inventory_id 
         where r.rental_date like "2005%%"
        ;'''
data = pd.read_sql_query(query,engine)
data.head(5)

,film_id,title,description,release_year,rental_duration,length,inventory_id,store_id,rental_id,customer_id,rental_date,staff_id
0,80,BLANKET BEVERLY,A Emotional Documentary of a Student And a Gir...,2006,7,148,367,1,1,130,2005-05-24 22:53:30,1
1,333,FREAKY POCUS,A Fast-Paced Documentary of a Pastry Chef And ...,2006,7,126,1525,2,2,459,2005-05-24 22:54:33,1
2,373,GRADUATE LORD,A Lacklusture Epistle of a Girl And a A Shark ...,2006,7,156,1711,2,3,408,2005-05-24 23:03:39,1
3,535,LOVE SUICIDES,A Brilliant Panorama of a Hunter And a Explore...,2006,6,181,2452,1,4,333,2005-05-24 23:04:41,2
4,450,IDOLS SNATCHERS,A Insightful Drama of a Car And a Composer who...,2006,5,84,2079,2,5,222,2005-05-24 23:05:21,1

In [6]:
data.shape

(15862, 12)

In [7]:
## Create a query to get the total amount of rentals in June for each film

In [8]:
query = '''select f.title, count(p.amount) as total_amount 
            from film as f
            join inventory as i
            on f.film_id = i.film_id
            join rental as r
            on r.inventory_id = i.inventory_id 
            join payment as p
            on r.rental_id = p.rental_id 
            where month (r.rental_date) = 6
            group by f.title;


'''

data_rental = pd.read_sql_query(query,engine)
data_rental.head(20)

                   title  total_amount
0       ACADEMY DINOSAUR             3
1       ADAPTATION HOLES             1
2       AFFAIR PREJUDICE             2
3            AFRICAN EGG             2
4           AGENT TRUMAN             3
5        AIRPLANE SIERRA             2
6        AIRPORT POLLOCK             3
7       ALADDIN CALENDAR             4
8        ALAMO VIDEOTAPE             3
9         ALASKA PHANTOM             5
10          ALIEN CENTER             3
11       ALLEY EVOLUTION             2
12            ALONE TRIP             2
13         ALTER VICTORY             3
14          AMADEUS HOLY             4
15   AMELIE HELLFIGHTERS             2
16       AMERICAN CIRCUS             3
17     AMISTAD MIDSUMMER             3
18  ANACONDA CONFESSIONS             5
19      ANALYZE HOOSIERS             3

In [9]:
## Do the same with July.

In [10]:
query = '''select f.title, count(p.amount) as total_amount 
            from film as f
            join inventory as i
            on f.film_id = i.film_id
            join rental as r
            on r.inventory_id = i.inventory_id 
            join payment as p
            on r.rental_id = p.rental_id 
            where month (r.rental_date) = 7
            group by f.title;


'''

data_rental = pd.read_sql_query(query,engine)
data_rental.head(20)

                  title  total_amount
0      ACADEMY DINOSAUR             9
1        ACE GOLDFINGER             2
2      ADAPTATION HOLES             4
3      AFFAIR PREJUDICE            12
4           AFRICAN EGG             5
5          AGENT TRUMAN             7
6       AIRPLANE SIERRA             6
7       AIRPORT POLLOCK             7
8         ALABAMA DEVIL             7
9      ALADDIN CALENDAR             8
10      ALAMO VIDEOTAPE            10
11       ALASKA PHANTOM            11
12          ALI FOREVER             4
13         ALIEN CENTER             8
14      ALLEY EVOLUTION             5
15           ALONE TRIP             6
16        ALTER VICTORY            11
17         AMADEUS HOLY             8
18  AMELIE HELLFIGHTERS             5
19      AMERICAN CIRCUS             8

In [11]:
## Create a new column containing (Yes/No) for each film whether or not the number of monthly rentals in July was bigger than in June. 
##Your objective will be to predict this new column

query = '''
    select f.film_id, f.title, 
        sum(case when month(r.rental_date)=6 then 1 else 0 end) as rentals_in_June,
        sum(case when month(r.rental_date)=7 then 1 else 0 end) as rentals_in_July 
    from film as f
    join inventory as i 
    on f.film_id =i.inventory_id
    join rental as r
    on i.inventory_id = r.inventory_id
    group by f.film_id, f.title 

'''

data = pd.read_sql_query(query, engine)
data['bigger_in_july'] = data.apply(lambda x: 'Yes' if x['rentals_in_July'] > x['rentals_in_June'] else 'No', axis=1)

# data= pd.read_sql_query(query,engine)

# data['bigger_in_july']=data.apply(lambda x: 'Yes' if x['rentals_in_july'] > x['rentals_in_june'] else 'No', axis=1)

In [12]:
data.head(10)

   film_id             title  rentals_in_June  rentals_in_July bigger_in_july
0        1  ACADEMY DINOSAUR              0.0              1.0            Yes
1        2    ACE GOLDFINGER              1.0              2.0            Yes
2        3  ADAPTATION HOLES              0.0              1.0            Yes
3        4  AFFAIR PREJUDICE              0.0              0.0             No
4        5       AFRICAN EGG              0.0              0.0             No
5        6      AGENT TRUMAN              1.0              2.0            Yes
6        7   AIRPLANE SIERRA              1.0              2.0            Yes
7        8   AIRPORT POLLOCK              0.0              1.0            Yes
8        9     ALABAMA DEVIL              0.0              0.0             No
9       10  ALADDIN CALENDAR              0.0              2.0            Yes

In [13]:
##Read the data into a Pandas dataframe.

In [14]:
data2 = pd.read_sql_query(query,engine)
data2.head(5)

   film_id             title  rentals_in_June  rentals_in_July
0        1  ACADEMY DINOSAUR              0.0              1.0
1        2    ACE GOLDFINGER              1.0              2.0
2        3  ADAPTATION HOLES              0.0              1.0
3        4  AFFAIR PREJUDICE              0.0              0.0
4        5       AFRICAN EGG              0.0              0.0

In [15]:
##Analyze extracted features and transform them. You may need to encode some categorical variables or scale numerical variables.

In [16]:
from sklearn.preprocessing import LabelEncoder, StandardScaler

#Check the data types of the columns to see if any transformations are necessary.

print (data.dtypes)

film_id              int64
title               object
rentals_in_June    float64
rentals_in_July    float64
bigger_in_july      object
dtype: object

In [17]:
#Encode categorical variables:
categorical_features =data.select_dtypes(include=['object']).columns
le = LabelEncoder()
data[categorical_features] = data[categorical_features].apply(lambda col: le.fit_transform(col))

In [18]:
data[categorical_features]

     title  bigger_in_july
0        0               1
1        1               1
2        2               1
3        3               0
4        4               0
..     ...             ...
995    995               1
996    996               1
997    997               1
998    998               1
999    999               1

[1000 rows x 2 columns]

In [19]:
#Scale numerical variables:
numberical_features =data.select_dtypes(include=['int64','float64']).columns
scaler = StandardScaler()
data[numberical_features] = scaler.fit_transform(data[numberical_features])

In [20]:
print(data.head(10))

    film_id     title  rentals_in_June  rentals_in_July  bigger_in_july
0 -1.730320 -1.730320        -0.976281        -0.692465        0.551163
1 -1.726856 -1.726856         1.024295         0.863637        0.551163
2 -1.723391 -1.723391        -0.976281        -0.692465        0.551163
3 -1.719927 -1.719927        -0.976281        -2.248568       -1.814344
4 -1.716463 -1.716463        -0.976281        -2.248568       -1.814344
5 -1.712999 -1.712999         1.024295         0.863637        0.551163
6 -1.709535 -1.709535         1.024295         0.863637        0.551163
7 -1.706071 -1.706071        -0.976281        -0.692465        0.551163
8 -1.702607 -1.702607        -0.976281        -2.248568       -1.814344
9 -1.699143 -1.699143        -0.976281         0.863637        0.551163

In [21]:
##Create a logistic regression model to predict this new column from the cleaned data

In [22]:
from sklearn.linear_model import LogisticRegression 
from sklearn.model_selection import train_test_split

# Split the data into training and test sets
x_train, x_test,y_train, y_test = train_test_split(data2[['film_id','rentals_in_July','rentals_in_June']],data2['title'], test_size=0.2, random_state=42)

# Train the logistic regression model
model = LogisticRegression()
model.fit(x_train, y_train)

# Predict the labels of the test set

# y_pred = linear_regression.predict(x_test)

/Users/tracy/opt/anaconda3/lib/python3.9/site-packages/sklearn/linear_model/_logistic.py:814: ConvergenceWarning: lbfgs failed to converge (status=1):
STOP: TOTAL NO. of ITERATIONS REACHED LIMIT.

Increase the number of iterations (max_iter) or scale the data as shown in:
    https://scikit-learn.org/stable/modules/preprocessing.html
Please also refer to the documentation for alternative solver options:
    https://scikit-learn.org/stable/modules/linear_model.html#logistic-regression
  n_iter_i = _check_optimize_result(

LogisticRegression()

In [23]:
##Evaluate the model on the test data
score =model.score(x_test, y_test)
print ("Accuracy:", score)

Accuracy: 0.0